In [15]:
import numpy as np
import pandas as pd
from numpy.random import randint

In [16]:
columns = ['W', 'X', 'Y', 'Z']
index = ['A', 'B', 'C', 'D', 'E']

In [17]:
np.random.seed(42)
data = randint(-100, 100, (5,4))
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [19]:
df = pd.DataFrame(data, index, columns)
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [20]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int64

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
type(df['W']) # => column is a Series

pandas.core.series.Series

In [26]:
df[['W']]

    W
A   2
B   6
C   2
D  16
E  30

In [27]:
df[['W', 'Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [30]:
df['new'] = df['W'] + df['Z']
df

    W   X   Y   Z  new
A   2  79  -8 -86  -84
B   6 -29  88 -80  -74
C   2  21 -26 -13  -11
D  16  -1   3  51   67
E  30  49 -48 -99  -69

In [35]:
df.drop('new', axis=1)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [36]:
df.drop('A', axis=0) # By default axis=0, so need to specify the axis here

    W   X   Y   Z  new
B   6 -29  88 -80  -74
C   2  21 -26 -13  -11
D  16  -1   3  51   67
E  30  49 -48 -99  -69

In [38]:
df.loc['A']

W       2
X      79
Y      -8
Z     -86
new   -84
Name: A, dtype: int64

In [43]:
df.loc[['A']]

   W   X  Y   Z  new
A  2  79 -8 -86  -84

In [44]:
df.loc[['A','E']]

    W   X   Y   Z  new
A   2  79  -8 -86  -84
E  30  49 -48 -99  -69

In [48]:
df.iloc[0]

W       2
X      79
Y      -8
Z     -86
new   -84
Name: A, dtype: int64

In [50]:
df.iloc[0:3]

   W   X   Y   Z  new
A  2  79  -8 -86  -84
B  6 -29  88 -80  -74
C  2  21 -26 -13  -11

In [51]:
df.drop('C') # By default axis=0, so NO need to specify the axis here

    W   X   Y   Z  new
A   2  79  -8 -86  -84
B   6 -29  88 -80  -74
D  16  -1   3  51   67
E  30  49 -48 -99  -69

In [55]:
df.loc['D', 'W']

16

In [61]:
df.loc[['A','C'], 'W']

A    2
C    2
Name: W, dtype: int64

In [63]:
df.loc[['A','C'], ['W']]

   W
A  2
C  2

In [64]:
df.loc[['A','C'], ['W', 'Y']]

   W   Y
A  2  -8
C  2 -26

In [65]:
df

    W   X   Y   Z  new
A   2  79  -8 -86  -84
B   6 -29  88 -80  -74
C   2  21 -26 -13  -11
D  16  -1   3  51   67
E  30  49 -48 -99  -69

In [66]:
df > 0

      W      X      Y      Z    new
A  True   True  False  False  False
B  True  False   True  False  False
C  True   True  False  False  False
D  True  False   True   True   True
E  True   True  False  False  False

In [67]:
df[df > 0]

    W     X     Y     Z   new
A   2  79.0   NaN   NaN   NaN
B   6   NaN  88.0   NaN   NaN
C   2  21.0   NaN   NaN   NaN
D  16   NaN   3.0  51.0  67.0
E  30  49.0   NaN   NaN   NaN

In [71]:
df['X'] > 0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [72]:
df[df['X'] > 0]

    W   X   Y   Z  new
A   2  79  -8 -86  -84
C   2  21 -26 -13  -11
E  30  49 -48 -99  -69

In [78]:
df[df['X'] > 0]['X']

A    79
C    21
E    49
Name: X, dtype: int64

In [79]:
df[df['X'] > 0][['X']]

    X
A  79
C  21
E  49

In [80]:
df[df['X'] > 0].iloc[0]

W       2
X      79
Y      -8
Z     -86
new   -84
Name: A, dtype: int64

In [82]:
(df['W'] > 0) & (df['Y'] > 1)

A    False
B     True
C    False
D     True
E    False
dtype: bool

In [83]:
(df['W'] > 0) | (df['Y'] > 1)

A    True
B    True
C    True
D    True
E    True
dtype: bool

In [84]:
df[(df['W'] > 0) & (df['Y'] > 1)]

    W   X   Y   Z  new
B   6 -29  88 -80  -74
D  16  -1   3  51   67

In [85]:
df.reset_index() # NOT permanent

  index   W   X   Y   Z  new
0     A   2  79  -8 -86  -84
1     B   6 -29  88 -80  -74
2     C   2  21 -26 -13  -11
3     D  16  -1   3  51   67
4     E  30  49 -48 -99  -69

In [86]:
df

    W   X   Y   Z  new
A   2  79  -8 -86  -84
B   6 -29  88 -80  -74
C   2  21 -26 -13  -11
D  16  -1   3  51   67
E  30  49 -48 -99  -69

In [87]:
new_index = ['CA','NY','WY','OR','CO']

In [102]:
df['States'] = new_index
df

         W   X   Y   Z  new States
States
CA       2  79  -8 -86  -84     CA
NY       6 -29  88 -80  -74     NY
WY       2  21 -26 -13  -11     WY
OR      16  -1   3  51   67     OR
CO      30  49 -48 -99  -69     CO

In [103]:
df = df.set_index('States')

In [104]:
df.columns

Index(['W', 'X', 'Y', 'Z', 'new'], dtype='object')

In [105]:
df.describe()

              W          X          Y          Z        new
count   5.00000   5.000000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000 -34.200000
std    11.96662  42.109381  51.915316  63.366395  63.353769
min     2.00000 -29.000000 -48.000000 -99.000000 -84.000000
25%     2.00000  -1.000000 -26.000000 -86.000000 -74.000000
50%     6.00000  21.000000  -8.000000 -80.000000 -69.000000
75%    16.00000  49.000000   3.000000 -13.000000 -11.000000
max    30.00000  79.000000  88.000000  51.000000  67.000000

In [107]:
df = df.drop('new', axis=1)

In [108]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [109]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      int64
 1   X       5 non-null      int64
 2   Y       5 non-null      int64
 3   Z       5 non-null      int64
dtypes: int64(4)
memory usage: 200.0+ bytes

In [110]:
df.dtypes

W    int64
X    int64
Y    int64
Z    int64
dtype: object